{"How is it different applying through a portal as compared to applying through personal mailing?": "When one applies through personal mailing, it is on him / her to track, mail and apply to various professors from different universities / colleges, whereas in a portal the student can select from the projects that have already been allocated to the portal and the student doesn't have to get involved in most of the internal work.","Does CG matter while applying in these projects?": "As CG is an integral part of your CV, it will have an impact on your selection. Rest depends on if the professor considers it an important factor while selection.","If I have been selected for a project through FTP, am I eligible to apply for the upcoming projects in the portal?": "Once you have been selected for a project through FTP, you are not eligible to apply for the upcoming projects. Your account will be deleted for that particular year.","After getting finalized for a project, can I back out from the same?": "After your final selection, you will be provided with an undertaking form which you need to fill if you want to continue. Backing off afterward will result in the blacklisting of the candidate and he / she will not be considered for any further through FTP Portal. Further, disciplinary actions may be taken by the Office of International Relations.","Does IR Cell provide any help while applying for a visa?": "No, you have to arrange it for yourself.","Will I be able to edit my profile if at all I commit some mistakes while making my account?": "You can only change your profile photo, passport status, contact number and alternate email. Other details cannot be edited till the end of that particular semester. We will release a deadline after every semester so that people can update their CGPA, CV and transcript also.","Is Foreign Training under FTP funded?": "Stipend varies with different projects, professors and universities. Most of the projects are funded and are sufficient to cover travel, accommodation and living expenses.","Where can I find the ERP generated transcript?": "Login to erp.iitkgp.ac.in and go to Academic > Students > Your academic information > Performance. Download the transcript which contains CGPA for all the semesters completed till date.","Can I get the activation link again in my mail in case I lost the previous one?": "You can register your account again and if it is not activated then you will be redirected to a page with an option to resend the link.","Can I apply with different CVs in different projects?": "Yes, while applying for projects, you will get an option to upload a different CV other than the default one.","How will I be informed if I get selected for a project?": "You will receive a mail from International Relations Cell if you get shortlisted for an interview or selected for a project.","I have forgotten my Zimbra mail password and thus, cannot activate my account. How can I reset it?": "To reset your Zimbra password, please mail helpdesk@cc.iitkgp.ac.in"}
